Jmeter Test & Results/aggregate_afteroptimization_moderate_load.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Moderate Load:Main Page,50,116,104,129,169,384,90,384,0.000%,.84917,0.88,0.16
Moderate Load:Main JS Bundle,50,66,63,78,94,109,51,109,0.000%,.84931,41.18,0.19
Moderate Load:Main CSS Bundle,50,64,61,74,78,132,49,132,0.000%,.84926,41.17,0.19
Moderate Load:Login,50,65324,65400,88135,88724,90341,10538,90341,0.000%,.36169,0.57,0.10
Moderate Load:My Bookings,50,17451,3263,59885,63273,67589,171,67589,0.000%,.39087,1.69,0.13
Moderate Load:Approved Events,50,4734,1995,5016,17789,67181,107,67181,0.000%,.39827,1.72,0.14
TOTAL,300,14626,129,63273,83313,88724,49,90341,0.000%,2.08616,37.62,0.55