aggregate_initial_moderate_load.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Main JS Bundle,50,136,135,153,156,170,114,170,0.000%,.84874,63.21,0.18
Main Page,50,44,38,48,50,293,31,293,0.000%,.85063,0.88,0.16
Main CSS Bundle,50,70,68,83,93,134,55,134,0.000%,.85041,63.34,0.18
Login,50,87575,93779,102098,102949,108297,11525,108297,0.000%,.34935,0.55,0.09
My Bookings,50,10435,7879,22671,23754,42123,388,42123,0.000%,.37852,1.46,0.13
Approved Events,50,5505,424,16718,20920,34349,250,34349,0.000%,.40165,1.73,0.14
TOTAL,300,17294,250,91411,99311,102949,31,108297,0.000%,1.94511,51.79,0.51