summary_initial_moderate_load.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
Main JS Bundle,50,136,114,170,14.04,0.000%,.84874,63.21,0.18,76264.0
Main Page,50,44,31,293,35.92,0.000%,.85063,0.88,0.16,1062.0
Main CSS Bundle,50,70,55,134,13.57,0.000%,.85041,63.34,0.18,76264.0
Login,50,87575,11525,108297,20574.77,0.000%,.34935,0.55,0.09,1615.0
My Bookings,50,10435,388,42123,9346.24,0.000%,.37852,1.46,0.13,3963.0
Approved Events,50,5505,250,34349,8600.04,0.000%,.40165,1.73,0.14,4415.0
TOTAL,300,17294,31,108297,33162.81,0.000%,1.94511,51.79,0.51,27263.8